Merge pull request #9 from pde-rent/order-handlers
Order handlers
